ycsb-mongodb-binding-0.15.0/ycsb.log
mongo client connection created with mongodb://mongo2:27018
[OVERALL], RunTime(ms), 434741
[OVERALL], Throughput(ops/sec), 1150.1100655332716
[TOTAL_GCS_G1_Young_Generation], Count, 54
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 218
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.05014479885725064
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 54
[TOTAL_GC_TIME], Time(ms), 218
[TOTAL_GC_TIME_%], Time(%), 0.05014479885725064
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 3370.5625
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 50815
[CLEANUP], 95thPercentileLatency(us), 3125
[CLEANUP], 99thPercentileLatency(us), 50815
[INSERT], Operations, 500000
[INSERT], AverageLatency(us), 13882.64391
[INSERT], MinLatency(us), 3174
[INSERT], MaxLatency(us), 6684671
[INSERT], 95thPercentileLatency(us), 17007
[INSERT], 99thPercentileLatency(us), 32719
[INSERT], Return=OK, 500000