ycsb-mongodb-binding-0.15.0/ycsb.log
mongo client connection created with mongodb://mongo1:27017
[OVERALL], RunTime(ms), 349544
[OVERALL], Throughput(ops/sec), 1430.4350811342779
[TOTAL_GCS_G1_Young_Generation], Count, 28
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 65
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.018595656054745613
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 65
[TOTAL_GC_TIME_%], Time(%), 0.018595656054745613
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 361.875
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 5779
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 5779
[INSERT], Operations, 500000
[INSERT], AverageLatency(us), 11159.273184
[INSERT], MinLatency(us), 3434
[INSERT], MaxLatency(us), 2312191
[INSERT], 95thPercentileLatency(us), 16015
[INSERT], 99thPercentileLatency(us), 20207
[INSERT], Return=OK, 500000